app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

DELETE FROM `clientes` WHERE `clientes`.`id` = 980190962
---
  def destroy
    @cliente.destroy

SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 980190962 LIMIT 1
---
    def set_cliente
      @cliente = Cliente.find(params[:id])