app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

INSERT INTO `comentarios` (`conteudo`, `comentavel_id`, `comentavel_type`, `created_at`, `updated_at`) VALUES ('MyText', 1, 'MyString', '2016-09-27 19:22:52', '2016-09-27 19:22:52')
---
  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save

SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 980190962
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy

SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1
---
    def set_comentario
      @comentario = Comentario.find(params[:id])